In [1]:
try:
    b=open("dta.csv","x")
    b.close()
except:
    print("the alerady rhere")

In [4]:
import csv
csvfile=open("dta.csv")
reader=csv.DictReader(csvfile)
for row in reader:
    print(row)

{'name': 'ram', 'age': '88', 'address': 'ktm', 'phone': '9841'}
{'name': 'sam', 'age': '99', 'address': 'bht', 'phone': '555'}
{'name': 'surn', 'age': '55sa', 'address': '5555', 'phone': None}
{'name': 'avi', 'age': '78', 'address': 'sddf', 'phone': '5522'}
{'name': 'jupi', 'age': '87', 'address': 'sdfff.888', 'phone': None}

In [10]:
import pandas as pd
df=pd.read_csv("dta.csv")
df

   name   age    address   phone
0   ram    88        ktm  9841.0
1   sam    99        bht   555.0
2  surn  55sa       5555     NaN
3   avi    78       sddf  5522.0
4  jupi    87  sdfff.888     NaN

In [12]:
import pandas as pd
df=pd.read_csv("dta.csv",nrows=2)
df

  name  age address  phone
0  ram   88     ktm   9841
1  sam   99     bht    555

In [14]:
import pandas as pd
df=pd.read_csv("dta.csv")
df.head(2)

  name age address   phone
0  ram  88     ktm  9841.0
1  sam  99     bht   555.0

In [18]:
import pandas as pd
df=pd.read_csv("dta.csv")
df.tail(2)

   sn  name age    address   phone
3   4   avi  78       sddf  5522.0
4   5  jupi  87  sdfff.888     NaN

In [21]:
import pandas as pd
df=pd.read_csv("dta.csv",index_col="sn")
df

    name   age    address   phone
sn
1    ram    88        ktm  9841.0
2    sam    99        bht   555.0
3   surn  55sa       5555     NaN
4    avi    78       sddf  5522.0
5   jupi    87  sdfff.888     NaN

In [36]:
import pandas as pd
df=pd.read_csv("dta.csv",index_col="sn")
df.iloc[0:3:,0:2]

    name   age
sn
1    ram    88
2    sam    99
3   surn  55sa

In [39]:
import pandas as pd
df=pd.read_csv("dta.csv",index_col="name")
df["sam":"avi"]

      sn   age address   phone
name
sam    2    99     bht   555.0
surn   3  55sa    5555     NaN
avi    4    78    sddf  5522.0

In [2]:
import pandas as pd
df=pd.read_csv("dta.csv",index_col="sn")
df[df["age"]>77]

TypeError: '>' not supported between instances of 'str' and 'int'

In [3]:
import pandas as pd
df=pd.read_csv("dta.csv",index_col="sn")
df[df["address"]=="ktm"]

   name age address   phone
sn
1   ram  88     ktm  9841.0

In [4]:
import pandas as pd
df=pd.read_csv("dta.csv",index_col="sn",usecol=["sn","name"])
df

TypeError: read_csv() got an unexpected keyword argument 'usecol'